Revit 2027 API
DuctFittingAndAccessoryConnectorData.Width Property
 The connector width, Units:(ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; }
Public ReadOnly Property Width As Double
	Get
public:
property double Width {
	double get ();
}
member Width : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace